HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_bf.h
/** \\brief  Mask for Ifx_MINIMCDS_CNT_CCL_Bits.CLV1 */
#define IFX_MINIMCDS_CNT_CCL_CLV1_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_CCL_Bits.CLV1 */
#define IFX_MINIMCDS_CNT_CCL_CLV1_OFF (31)

/** \\brief  Length for Ifx_MINIMCDS_CNT_CCL_Bits.ILV0 */
#define IFX_MINIMCDS_CNT_CCL_ILV0_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_CCL_Bits.ILV0 */
#define IFX_MINIMCDS_CNT_CCL_ILV0_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_CCL_Bits.ILV0 */
#define IFX_MINIMCDS_CNT_CCL_ILV0_OFF (7)

/** \\brief  Length for Ifx_MINIMCDS_CNT_CCL_Bits.ILV1 */
#define IFX_MINIMCDS_CNT_CCL_ILV1_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_CCL_Bits.ILV1 */
#define IFX_MINIMCDS_CNT_CCL_ILV1_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_CCL_Bits.ILV1 */
#define IFX_MINIMCDS_CNT_CCL_ILV1_OFF (23)

/** \\brief  Length for Ifx_MINIMCDS_CNT_CCL_Bits.INC0 */
#define IFX_MINIMCDS_CNT_CCL_INC0_LEN (7)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_CCL_Bits.INC0 */
#define IFX_MINIMCDS_CNT_CCL_INC0_MSK (0x7f)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_CCL_Bits.INC0 */
#define IFX_MINIMCDS_CNT_CCL_INC0_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_CNT_CCL_Bits.INC1 */
#define IFX_MINIMCDS_CNT_CCL_INC1_LEN (7)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_CCL_Bits.INC1 */
#define IFX_MINIMCDS_CNT_CCL_INC1_MSK (0x7f)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_CCL_Bits.INC1 */
#define IFX_MINIMCDS_CNT_CCL_INC1_OFF (16)

/** \\brief  Length for Ifx_MINIMCDS_CNT_CNT_Bits.COUNT */
#define IFX_MINIMCDS_CNT_CNT_COUNT_LEN (16)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_CNT_Bits.COUNT */
#define IFX_MINIMCDS_CNT_CNT_COUNT_MSK (0xffff)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_CNT_Bits.COUNT */
#define IFX_MINIMCDS_CNT_CNT_COUNT_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_CNT_LMT_Bits.LIMIT */
#define IFX_MINIMCDS_CNT_LMT_LIMIT_LEN (16)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_LMT_Bits.LIMIT */
#define IFX_MINIMCDS_CNT_LMT_LIMIT_MSK (0xffff)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_LMT_Bits.LIMIT */
#define IFX_MINIMCDS_CNT_LMT_LIMIT_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_CNT_LMT_Bits.MOD0 */
#define IFX_MINIMCDS_CNT_LMT_MOD0_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_LMT_Bits.MOD0 */
#define IFX_MINIMCDS_CNT_LMT_MOD0_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_LMT_Bits.MOD0 */
#define IFX_MINIMCDS_CNT_LMT_MOD0_OFF (30)

/** \\brief  Length for Ifx_MINIMCDS_CNT_LMT_Bits.MOD1 */
#define IFX_MINIMCDS_CNT_LMT_MOD1_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CNT_LMT_Bits.MOD1 */
#define IFX_MINIMCDS_CNT_LMT_MOD1_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CNT_LMT_Bits.MOD1 */
#define IFX_MINIMCDS_CNT_LMT_MOD1_OFF (31)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.BED */
#define IFX_MINIMCDS_CT_BED_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.BED */
#define IFX_MINIMCDS_CT_BED_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.BED */
#define IFX_MINIMCDS_CT_BED_OFF (16)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.BED_P */
#define IFX_MINIMCDS_CT_BED_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.BED_P */
#define IFX_MINIMCDS_CT_BED_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.BED_P */
#define IFX_MINIMCDS_CT_BED_P_OFF (19)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.CLRE */
#define IFX_MINIMCDS_CT_CLRE_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.CLRE */
#define IFX_MINIMCDS_CT_CLRE_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.CLRE */
#define IFX_MINIMCDS_CT_CLRE_OFF (14)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.CLRI */
#define IFX_MINIMCDS_CT_CLRI_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.CLRI */
#define IFX_MINIMCDS_CT_CLRI_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.CLRI */
#define IFX_MINIMCDS_CT_CLRI_OFF (22)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.EN */
#define IFX_MINIMCDS_CT_EN_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.EN */
#define IFX_MINIMCDS_CT_EN_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.EN */
#define IFX_MINIMCDS_CT_EN_OFF (13)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.IRA */
#define IFX_MINIMCDS_CT_IRA_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.IRA */
#define IFX_MINIMCDS_CT_IRA_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.IRA */
#define IFX_MINIMCDS_CT_IRA_OFF (21)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.IWA */
#define IFX_MINIMCDS_CT_IWA_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.IWA */
#define IFX_MINIMCDS_CT_IWA_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.IWA */
#define IFX_MINIMCDS_CT_IWA_OFF (23)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.KAV */
#define IFX_MINIMCDS_CT_KAV_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.KAV */
#define IFX_MINIMCDS_CT_KAV_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.KAV */
#define IFX_MINIMCDS_CT_KAV_OFF (7)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.KOK */
#define IFX_MINIMCDS_CT_KOK_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.KOK */
#define IFX_MINIMCDS_CT_KOK_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.KOK */
#define IFX_MINIMCDS_CT_KOK_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.RES */
#define IFX_MINIMCDS_CT_RES_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.RES */
#define IFX_MINIMCDS_CT_RES_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.RES */
#define IFX_MINIMCDS_CT_RES_OFF (29)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.SETE */
#define IFX_MINIMCDS_CT_SETE_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.SETE */
#define IFX_MINIMCDS_CT_SETE_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.SETE */
#define IFX_MINIMCDS_CT_SETE_OFF (15)

/** \\brief  Length for Ifx_MINIMCDS_CT_Bits.SETR */
#define IFX_MINIMCDS_CT_SETR_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_CT_Bits.SETR */
#define IFX_MINIMCDS_CT_SETR_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_CT_Bits.SETR */
#define IFX_MINIMCDS_CT_SETR_OFF (31)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ0 */
#define IFX_MINIMCDS_EVT_EIQ0_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ0 */
#define IFX_MINIMCDS_EVT_EIQ0_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ0 */
#define IFX_MINIMCDS_EVT_EIQ0_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ10 */
#define IFX_MINIMCDS_EVT_EIQ10_LEN (2)

