HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_bf.h
/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ10 */
#define IFX_MINIMCDS_EVT_EIQ10_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ10 */
#define IFX_MINIMCDS_EVT_EIQ10_OFF (20)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ11 */
#define IFX_MINIMCDS_EVT_EIQ11_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ11 */
#define IFX_MINIMCDS_EVT_EIQ11_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ11 */
#define IFX_MINIMCDS_EVT_EIQ11_OFF (22)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ12 */
#define IFX_MINIMCDS_EVT_EIQ12_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ12 */
#define IFX_MINIMCDS_EVT_EIQ12_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ12 */
#define IFX_MINIMCDS_EVT_EIQ12_OFF (24)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ13 */
#define IFX_MINIMCDS_EVT_EIQ13_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ13 */
#define IFX_MINIMCDS_EVT_EIQ13_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ13 */
#define IFX_MINIMCDS_EVT_EIQ13_OFF (26)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ14 */
#define IFX_MINIMCDS_EVT_EIQ14_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ14 */
#define IFX_MINIMCDS_EVT_EIQ14_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ14 */
#define IFX_MINIMCDS_EVT_EIQ14_OFF (28)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ15 */
#define IFX_MINIMCDS_EVT_EIQ15_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ15 */
#define IFX_MINIMCDS_EVT_EIQ15_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ15 */
#define IFX_MINIMCDS_EVT_EIQ15_OFF (30)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ1 */
#define IFX_MINIMCDS_EVT_EIQ1_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ1 */
#define IFX_MINIMCDS_EVT_EIQ1_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ1 */
#define IFX_MINIMCDS_EVT_EIQ1_OFF (2)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ2 */
#define IFX_MINIMCDS_EVT_EIQ2_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ2 */
#define IFX_MINIMCDS_EVT_EIQ2_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ2 */
#define IFX_MINIMCDS_EVT_EIQ2_OFF (4)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ3 */
#define IFX_MINIMCDS_EVT_EIQ3_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ3 */
#define IFX_MINIMCDS_EVT_EIQ3_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ3 */
#define IFX_MINIMCDS_EVT_EIQ3_OFF (6)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ4 */
#define IFX_MINIMCDS_EVT_EIQ4_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ4 */
#define IFX_MINIMCDS_EVT_EIQ4_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ4 */
#define IFX_MINIMCDS_EVT_EIQ4_OFF (8)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ5 */
#define IFX_MINIMCDS_EVT_EIQ5_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ5 */
#define IFX_MINIMCDS_EVT_EIQ5_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ5 */
#define IFX_MINIMCDS_EVT_EIQ5_OFF (10)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ6 */
#define IFX_MINIMCDS_EVT_EIQ6_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ6 */
#define IFX_MINIMCDS_EVT_EIQ6_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ6 */
#define IFX_MINIMCDS_EVT_EIQ6_OFF (12)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ7 */
#define IFX_MINIMCDS_EVT_EIQ7_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ7 */
#define IFX_MINIMCDS_EVT_EIQ7_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ7 */
#define IFX_MINIMCDS_EVT_EIQ7_OFF (14)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ8 */
#define IFX_MINIMCDS_EVT_EIQ8_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ8 */
#define IFX_MINIMCDS_EVT_EIQ8_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ8 */
#define IFX_MINIMCDS_EVT_EIQ8_OFF (16)

/** \\brief  Length for Ifx_MINIMCDS_EVT_Bits.EIQ9 */
#define IFX_MINIMCDS_EVT_EIQ9_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_EVT_Bits.EIQ9 */
#define IFX_MINIMCDS_EVT_EIQ9_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_EVT_Bits.EIQ9 */
#define IFX_MINIMCDS_EVT_EIQ9_OFF (18)

/** \\brief  Length for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_LEN (3)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_MSK (0x7)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOBOT_Bits.BOTTOM */
#define IFX_MINIMCDS_FIFOBOT_BOTTOM_OFF (10)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.CLR */
#define IFX_MINIMCDS_FIFOCTL_CLR_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.CLR */
#define IFX_MINIMCDS_FIFOCTL_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.CLR */
#define IFX_MINIMCDS_FIFOCTL_CLR_OFF (14)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.FFE */
#define IFX_MINIMCDS_FIFOCTL_FFE_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.FFE */
#define IFX_MINIMCDS_FIFOCTL_FFE_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.FFE */
#define IFX_MINIMCDS_FIFOCTL_FFE_OFF (1)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.FLSH */
#define IFX_MINIMCDS_FIFOCTL_FLSH_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.FLSH */
#define IFX_MINIMCDS_FIFOCTL_FLSH_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.FLSH */
#define IFX_MINIMCDS_FIFOCTL_FLSH_OFF (13)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.SET */
#define IFX_MINIMCDS_FIFOCTL_SET_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.SET */
#define IFX_MINIMCDS_FIFOCTL_SET_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.SET */
#define IFX_MINIMCDS_FIFOCTL_SET_OFF (15)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.TRDIS */
#define IFX_MINIMCDS_FIFOCTL_TRDIS_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TRDIS */
#define IFX_MINIMCDS_FIFOCTL_TRDIS_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TRDIS */
#define IFX_MINIMCDS_FIFOCTL_TRDIS_OFF (9)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.TRG */
#define IFX_MINIMCDS_FIFOCTL_TRG_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TRG */
#define IFX_MINIMCDS_FIFOCTL_TRG_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TRG */
#define IFX_MINIMCDS_FIFOCTL_TRG_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.TROFF */
#define IFX_MINIMCDS_FIFOCTL_TROFF_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TROFF */
#define IFX_MINIMCDS_FIFOCTL_TROFF_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TROFF */
#define IFX_MINIMCDS_FIFOCTL_TROFF_OFF (11)

/** \\brief  Length for Ifx_MINIMCDS_FIFOCTL_Bits.TRON */
#define IFX_MINIMCDS_FIFOCTL_TRON_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOCTL_Bits.TRON */
#define IFX_MINIMCDS_FIFOCTL_TRON_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOCTL_Bits.TRON */
#define IFX_MINIMCDS_FIFOCTL_TRON_OFF (10)

