HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_bf.h
/** \\brief  Length for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_FIFONOW_Bits.NOW */
#define IFX_MINIMCDS_FIFONOW_NOW_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_FIFOPRE_Bits.PRE */
#define IFX_MINIMCDS_FIFOPRE_PRE_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOPRE_Bits.PRE */
#define IFX_MINIMCDS_FIFOPRE_PRE_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOPRE_Bits.PRE */
#define IFX_MINIMCDS_FIFOPRE_PRE_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_FIFOTOP_Bits.TOP */
#define IFX_MINIMCDS_FIFOTOP_TOP_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOTOP_Bits.TOP */
#define IFX_MINIMCDS_FIFOTOP_TOP_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOTOP_Bits.TOP */
#define IFX_MINIMCDS_FIFOTOP_TOP_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_FIFOWARN0_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN0_EN_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOWARN0_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN0_EN_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOWARN0_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN0_EN_OFF (31)

/** \\brief  Length for Ifx_MINIMCDS_FIFOWARN0_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN0_WARN_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOWARN0_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN0_WARN_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOWARN0_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN0_WARN_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_FIFOWARN1_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN1_EN_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOWARN1_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN1_EN_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOWARN1_Bits.EN */
#define IFX_MINIMCDS_FIFOWARN1_EN_OFF (31)

/** \\brief  Length for Ifx_MINIMCDS_FIFOWARN1_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN1_WARN_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_FIFOWARN1_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN1_WARN_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_FIFOWARN1_Bits.WARN */
#define IFX_MINIMCDS_FIFOWARN1_WARN_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_ID_Bits.MOD_REV */
#define IFX_MINIMCDS_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_ID_Bits.MOD_REV */
#define IFX_MINIMCDS_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_ID_Bits.MOD_REV */
#define IFX_MINIMCDS_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_ID_Bits.MOD_TYPE */
#define IFX_MINIMCDS_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_MINIMCDS_ID_Bits.MOD_TYPE */
#define IFX_MINIMCDS_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_MINIMCDS_ID_Bits.MOD_TYPE */
#define IFX_MINIMCDS_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_MINIMCDS_ID_Bits.MODNUMBER */
#define IFX_MINIMCDS_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_MINIMCDS_ID_Bits.MODNUMBER */
#define IFX_MINIMCDS_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_MINIMCDS_ID_Bits.MODNUMBER */
#define IFX_MINIMCDS_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.RC */
#define IFX_MINIMCDS_MUX_RC_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.RC */
#define IFX_MINIMCDS_MUX_RC_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.RC */
#define IFX_MINIMCDS_MUX_RC_OFF (24)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.RC_P */
#define IFX_MINIMCDS_MUX_RC_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.RC_P */
#define IFX_MINIMCDS_MUX_RC_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.RC_P */
#define IFX_MINIMCDS_MUX_RC_P_OFF (27)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TM0_P */
#define IFX_MINIMCDS_MUX_TM0_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TM0_P */
#define IFX_MINIMCDS_MUX_TM0_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TM0_P */
#define IFX_MINIMCDS_MUX_TM0_P_OFF (7)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TM1_P */
#define IFX_MINIMCDS_MUX_TM1_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TM1_P */
#define IFX_MINIMCDS_MUX_TM1_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TM1_P */
#define IFX_MINIMCDS_MUX_TM1_P_OFF (15)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TM2_P */
#define IFX_MINIMCDS_MUX_TM2_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TM2_P */
#define IFX_MINIMCDS_MUX_TM2_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TM2_P */
#define IFX_MINIMCDS_MUX_TM2_P_OFF (19)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TM3_P */
#define IFX_MINIMCDS_MUX_TM3_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TM3_P */
#define IFX_MINIMCDS_MUX_TM3_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TM3_P */
#define IFX_MINIMCDS_MUX_TM3_P_OFF (23)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TMUX0 */
#define IFX_MINIMCDS_MUX_TMUX0_LEN (4)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TMUX0 */
#define IFX_MINIMCDS_MUX_TMUX0_MSK (0xf)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TMUX0 */
#define IFX_MINIMCDS_MUX_TMUX0_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TMUX1 */
#define IFX_MINIMCDS_MUX_TMUX1_LEN (4)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TMUX1 */
#define IFX_MINIMCDS_MUX_TMUX1_MSK (0xf)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TMUX1 */
#define IFX_MINIMCDS_MUX_TMUX1_OFF (8)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TMUX2 */
#define IFX_MINIMCDS_MUX_TMUX2_LEN (3)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TMUX2 */
#define IFX_MINIMCDS_MUX_TMUX2_MSK (0x7)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TMUX2 */
#define IFX_MINIMCDS_MUX_TMUX2_OFF (16)

/** \\brief  Length for Ifx_MINIMCDS_MUX_Bits.TMUX3 */
#define IFX_MINIMCDS_MUX_TMUX3_LEN (3)

/** \\brief  Mask for Ifx_MINIMCDS_MUX_Bits.TMUX3 */
#define IFX_MINIMCDS_MUX_TMUX3_MSK (0x7)

/** \\brief  Offset for Ifx_MINIMCDS_MUX_Bits.TMUX3 */
#define IFX_MINIMCDS_MUX_TMUX3_OFF (20)

/** \\brief  Length for Ifx_MINIMCDS_OCS_Bits.SUS */
#define IFX_MINIMCDS_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_MINIMCDS_OCS_Bits.SUS */
#define IFX_MINIMCDS_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_MINIMCDS_OCS_Bits.SUS */
#define IFX_MINIMCDS_OCS_SUS_OFF (24)

