HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_bf.h
/** \\brief  Length for Ifx_MINIMCDS_OCS_Bits.SUS_P */
#define IFX_MINIMCDS_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_OCS_Bits.SUS_P */
#define IFX_MINIMCDS_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_OCS_Bits.SUS_P */
#define IFX_MINIMCDS_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_MINIMCDS_OCS_Bits.SUSSTA */
#define IFX_MINIMCDS_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_OCS_Bits.SUSSTA */
#define IFX_MINIMCDS_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_OCS_Bits.SUSSTA */
#define IFX_MINIMCDS_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_MINIMCDS_TCX_CFT_Bits.SHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_SHRT_FCT_LEN (10)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_CFT_Bits.SHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_SHRT_FCT_MSK (0x3ff)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_CFT_Bits.SHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_SHRT_FCT_OFF (16)

/** \\brief  Length for Ifx_MINIMCDS_TCX_CFT_Bits.VSHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_VSHRT_FCT_LEN (10)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_CFT_Bits.VSHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_VSHRT_FCT_MSK (0x3ff)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_CFT_Bits.VSHRT_FCT */
#define IFX_MINIMCDS_TCX_CFT_VSHRT_FCT_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MINIMCDS_TCX_CIP_CURRENT_LEN (31)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MINIMCDS_TCX_CIP_CURRENT_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_CIP_Bits.CURRENT */
#define IFX_MINIMCDS_TCX_CIP_CURRENT_OFF (1)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MINIMCDS_TCX_DCSTS_CLKDIV_LEN (2)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MINIMCDS_TCX_DCSTS_CLKDIV_MSK (0x3)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.CLKDIV */
#define IFX_MINIMCDS_TCX_DCSTS_CLKDIV_OFF (9)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MINIMCDS_TCX_DCSTS_DBGEN_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MINIMCDS_TCX_DCSTS_DBGEN_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.DBGEN */
#define IFX_MINIMCDS_TCX_DCSTS_DBGEN_OFF (8)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MINIMCDS_TCX_DCSTS_HALT_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MINIMCDS_TCX_DCSTS_HALT_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.HALT */
#define IFX_MINIMCDS_TCX_DCSTS_HALT_OFF (2)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MINIMCDS_TCX_DCSTS_HBRK_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MINIMCDS_TCX_DCSTS_HBRK_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.HBRK */
#define IFX_MINIMCDS_TCX_DCSTS_HBRK_OFF (4)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MINIMCDS_TCX_DCSTS_IDLE_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MINIMCDS_TCX_DCSTS_IDLE_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.IDLE */
#define IFX_MINIMCDS_TCX_DCSTS_IDLE_OFF (1)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MINIMCDS_TCX_DCSTS_IEN_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MINIMCDS_TCX_DCSTS_IEN_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.IEN */
#define IFX_MINIMCDS_TCX_DCSTS_IEN_OFF (7)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MINIMCDS_TCX_DCSTS_ISR_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MINIMCDS_TCX_DCSTS_ISR_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.ISR */
#define IFX_MINIMCDS_TCX_DCSTS_ISR_OFF (3)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MINIMCDS_TCX_DCSTS_SBRK_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MINIMCDS_TCX_DCSTS_SBRK_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.SBRK */
#define IFX_MINIMCDS_TCX_DCSTS_SBRK_OFF (5)

/** \\brief  Length for Ifx_MINIMCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MINIMCDS_TCX_DCSTS_SUS_LEN (1)

/** \\brief  Mask for Ifx_MINIMCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MINIMCDS_TCX_DCSTS_SUS_MSK (0x1)

/** \\brief  Offset for Ifx_MINIMCDS_TCX_DCSTS_Bits.SUS */
#define IFX_MINIMCDS_TCX_DCSTS_SUS_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXEA_BND_BOUND_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXEA_BND_BOUND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXEA_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXEA_BND_BOUND_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXEA_RNG_RANGE_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXEA_RNG_RANGE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXEA_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXEA_RNG_RANGE_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXIP_BND_BOUND_LEN (31)

/** \\brief  Mask for Ifx_MINIMCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXIP_BND_BOUND_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXIP_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXIP_BND_BOUND_OFF (1)

/** \\brief  Length for Ifx_MINIMCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXIP_RNG_RANGE_LEN (31)

/** \\brief  Mask for Ifx_MINIMCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXIP_RNG_RANGE_MSK (0x7fffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXIP_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXIP_RNG_RANGE_OFF (1)

/** \\brief  Length for Ifx_MINIMCDS_TCXWD_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXWD_BND_BOUND_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TCXWD_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXWD_BND_BOUND_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXWD_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCXWD_BND_BOUND_OFF (0)

