HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_bf.h
/** \\brief  Length for Ifx_MINIMCDS_TCXWD_MSK_Bits.MASK */
#define IFX_MINIMCDS_TCXWD_MSK_MASK_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TCXWD_MSK_Bits.MASK */
#define IFX_MINIMCDS_TCXWD_MSK_MASK_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXWD_MSK_Bits.MASK */
#define IFX_MINIMCDS_TCXWD_MSK_MASK_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TCXWD_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXWD_RNG_RANGE_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TCXWD_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXWD_RNG_RANGE_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TCXWD_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCXWD_RNG_RANGE_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MINIMCDS_TCXWD_SGN_SIGN_LEN (5)

/** \\brief  Mask for Ifx_MINIMCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MINIMCDS_TCXWD_SGN_SIGN_MSK (0x1f)

/** \\brief  Offset for Ifx_MINIMCDS_TCXWD_SGN_Bits.SIGN */
#define IFX_MINIMCDS_TCXWD_SGN_SIGN_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUEMUCNT_COUNT_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUEMUCNT_COUNT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TSUEMUCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUEMUCNT_COUNT_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MINIMCDS_TSUPRSCL_RELOAD_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MINIMCDS_TSUPRSCL_RELOAD_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TSUPRSCL_Bits.RELOAD */
#define IFX_MINIMCDS_TSUPRSCL_RELOAD_OFF (0)

/** \\brief  Length for Ifx_MINIMCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUREFCNT_COUNT_LEN (32)

/** \\brief  Mask for Ifx_MINIMCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUREFCNT_COUNT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_MINIMCDS_TSUREFCNT_Bits.COUNT */
#define IFX_MINIMCDS_TSUREFCNT_COUNT_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMINIMCDS_BF_H */
